wso2-esb/header-based-routing/resources/example-requests/SOAP-Req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
   <m0:CheckPriceRequest xmlns:m0="http://services.samples">
   		<m0:Code>WSO2</m0:Code>
   	</m0:CheckPriceRequest>
   </soapenv:Body>
</soapenv:Envelope>
